{
    "project name":"Customer Service System",
    "business description":"This project was initiated during the pandemic, while I was working at a junior company, with the aim of helping a vehicle inspection company to provide remote service to its customers. To meet this need, a system was developed with a website where administrators can receive customer demands, analyze documents, and provide responses to requests. Additionally, an application was created for customers to request service, send documents, and receive feedback from the company.",
    "technical description":"From a technical perspective, this project was built using a NodeJS Rest API with the Express framework, a MySQL database, and the frontend (website accessed by administrators) in ReactJS. Additionally, the customer-facing application was developed in Flutter, and documents were stored using the AWS S3 service. When a request was made, a new order was created in the database containing the customer's information and references to the documents in S3. As the service progressed, the status of the order was updated, and the customer received notifications through the application.",
    "work methodology":"To manage this project, we used Scrum with a team of 6 people, following 2-week sprints and constant meetings with the client for review. Before each sprint, we conducted planning to define the objectives for the next two weeks, and we had daily internal meetings to monitor progress and ensure that the project was on track. Before development, a system prototype was created using Figma, and each sprint delivered a portion of the system.",
    "my learnings":"During this project, I had many opportunities for learning, as part of a junior company, where I was responsible for both the technical aspects and management and communication with the client. This significantly contributed to my professional growth. During this period, I learned a lot about project management and people management, as well as developed effective teaching skills, as I needed to share knowledge gained from other experiences (such as an internship) with other members of the team."
}