{
    "project name":"Data Collection System",
    "business description":"This project was developed during my internship at DTI Digital. The client we were serving had a demand to improve the collection and storage of audit and internal process data. To meet this demand, we developed a system that facilitates the formatting, storage, and collection of this data. The system consists of a web part, where forms are created, a secure database where the information is stored and made available for analysis, and an application that facilitates the collection of this data.",
    "technical description":"Regarding the technical aspect, the project used .NetCore to build the API that serves both the web and mobile application. The chosen database was SQL Server, due to the company's existing context with Microsoft. React with Typescript was used for the web frontend, and Flutter was used for the mobile frontend. The API provided information in JSON format to facilitate connections with tools such as PowerBI for data analysis. The system was published using the Azure platform with Active Directory was used for permission management.",
    "Work Methodology":"For the construction of this project, a design sprint was initially carried out to understand the needs that the product should meet. Then, a prototype was developed using design tools such as Figma to validate with the client what would be built. During development, Scrum with two-week sprints was used, with recurring meetings with clients, planning at the beginning of each sprint, daily meetings for tracking progress, and reviews at the end of each sprint. Some additional rituals were performed, such as the architectural check, to discuss aspects of the system architecture with other squads in the company.",
    "my learnings":"Through this project, I was able to acquire valuable knowledge and skills for my professional development. I learned about software development in an agile context, Scrum, and stakeholder management. These learnings were very useful for my participation in other projects, such as those carried out in the junior company. Additionally, technically, participating in this project was extremely enriching, as I was able to be part of the development of a large system from scratch, understanding each step and the consequences of each decision made."
}