{
    "project name":"Data Lake Preditive Maintenance",
    "business description":"During my master's degree, I am developing a project to build a data lake for aggregating production line data from a company. With the aim of improving production line efficiency, the system processes data collected by sensors on each machine, applying statistical and predictive analysis to identify trends and behaviors that may cause interruptions or defects in the process. The information is made available through a web-based dashboard. Through the implementation of this project, it is expected to reduce machine downtime, decrease the number of defective parts, and increase overall production line efficiency.",
    "technical description":"For the technical part of the project, the system is divided into processing modules, API, and dashboard. The data processing is done by small modules in Python that run periodically to analyze the latest data and generate aggregated statistical information. To make the information available to the frontend (dashboard), a Python API is being developed using the FastAPI framework. This API is responsible for providing historical data generated by the processing modules, as well as data received in real-time via stream. The frontend is being built in ReactTS with NextJs and uses the Recharts library for chart construction. The Context API is used to manage global application information.",
    "Work Methodology":"To carry out this project, we started with an analysis with the company to identify the main information that would be useful to be presented in the dashboard. Based on this analysis, we created a prototype in Figma to make it clear how the development would be. After the prototype was approved, we began the project execution. As I am developing the project alone, we hold monthly meetings to present progress, answer questions, and ensure that the project is moving towards the desired goal. At the end of each meeting, we define the objectives for the next month so that all involved are aligned.",
    "my learnings":"With this project, I am gaining valuable insights into the context and needs of an industry in becoming more digital and using new technologies efficiently to generate positive results. On the technical side, I have the opportunity to work with statistical data analysis in a practical way, as well as to build a data lake with multiple layers and orchestrate small processing modules in Python. I am also deepening my knowledge in React and Next.js, which will certainly be a great advantage in my future projects."
}