{
    "About me":"Sobre mim",
    "Software Engineer":"Engenheiro de Software",
    "Contact":"Contato",
    "About":"Sobre mim",
    "Work Methodology":"Metodologia",
    "Work Experience":"Trabalhos realizados",
    "Start": "Inicio",
    "Work Experience Description1": "Desenvolvi sistemas em diversos contextos, incluindo startup e empresa júnior.",
    "Work Experience Description2": "Atualmente, estou cursando meu mestrado e trabalhando em um grande projeto. Abaixo, estão listados alguns dos projetos nos quais participei. Clique para mais detalhes:",
    "You can get in contact":"Pode entrar em contato por whatsapp, email ou minhas redes sociais:",
    "See also":"Veja também",
    "Product/Business Description":"Descrição de produto/Negocio",
    "Technical Description":"Descrição Técnica",
    "My Learning":"Meus Aprendizados",
    "Methodoly and Learnings":"Metodologia e aprendizados",
    "Business and Technical Description":"Descrição Técnica e de Negocio",
    "Previous":"Anterior",
    "Next":"Proximo",
    "How I work":"Como Trabalho",
    "How I work 1":"Eu sou uma pessoa que trabalha com tecnologia e também sou apaixonado por negócios. Acredito que a tecnologia é capaz de levar um negócio a um patamar mais profissional, confiável e escalável, desde que haja processos bem estruturados e organização interna. Por isso, sempre busco aprimorar meus conhecimentos nesses dois campos, para poder oferecer soluções inovadoras e eficientes para as empresas com as quais trabalho.",
    "How I work 2":"Dessa forma, o processo de construção de um projeto começa com a compreensão do problema e a definição do objetivo. Em seguida, são levantadas possibilidades de solução e as melhores ideias são avaliadas, considerando riscos, custos e chances de sucesso. Na quarta fase, um protótipo é construído para testar a ideia. Essas etapas iniciais foram pensadas para serem rápidas e eficientes, permitindo soluções para problemas complexos em um curto espaço de tempo, para depois ir para o desenvolvimento.",
    "How I work 3":"O desenvolvimento de software é incremental, ou seja, feito em etapas. Cada etapa adiciona funcionalidades ou melhorias à versão anterior do software, permitindo avaliar o produto e decidir quais recursos ou melhorias são necessários para a próxima etapa. Ao final de cada etapa, há uma versão testável para receber feedback dos usuários e corrigir problemas ou adicionar recursos para a próxima etapa.",
    "How I work 4":" Essa abordagem ágil permite às equipes de desenvolvimento responder às necessidades dos usuários e do negócio de maneira eficiente, ajustando às necessidades de mercado ao longo do tempo.",
    "Are you interested in my work? Get in touch:":"Ficou interessado no meu trabalho? Entre em contato:",
    "I hope to contribute":"Estou ansioso para trazer minha dedicação, habilidades e experiência para o seu próximo projeto. Vamos criar algo incrível juntos!",
    "I always seek to develop my discipline":"No entanto, o que realmente me motiva é ver os resultados tangíveis dos meus esforços. Seja um projeto de software que melhora a eficiência de uma empresa ou um aplicativo que torna a vida das pessoas um pouco mais fácil, estou comprometido em criar soluções de alta qualidade que gerem resultados reais.",
    "In my leisure time":"Quando não estou codificando ou estudando, você pode me encontrar na academia, ouvindo uma variedade eclética de músicas no Spotify, ou explorando tudo o que a Europa tem a oferecer.",
    "Currently, I am living in Bragança, Portugal":"Atualmente, estou expandindo meus horizontes em Bragança, Portugal, onde estou cursando mestrado no Instituto Politécnico de Bragança. Esta experiência internacional tem enriquecido minha perspectiva cultural e pessoal, além de me permitir colaborar com profissionais altamente qualificados de todo o mundo. Tenho certeza de que esta experiência internacional me permite trazer uma perspectiva única para todos os projetos em que trabalho.",
    "Hi! My name is Leonardo Leite, I work with software engineering":"Olá! Meu nome é Leonardo Leite, um engenheiro de software dedicado e disciplinado, com uma paixão por transformar ideias complexas em soluções de software elegantes e eficazes. Nasci em Belo Horizonte, Minas Gerais (Brasil), e desde a minha época de faculdade, tenho estado profundamente envolvido no mundo do empreendedorismo. Fui um dos fundadores da empresa júnior de Engenharia de Computação do CEFET-MG, uma experiência que moldou profundamente a minha abordagem ao desenvolvimento de software e ao trabalho em equipe."
}