{
    "About me":"Sobre mim",
    "Software Engineer":"Engenheiro de Software",
    "Contact":"Contato",
    "About":"Sobre mim",
    "Work Methodoly":"Metodologia",
    "Work Experience":"Trabalhos realizados",
    "Start": "Inicio",
    "Work Experience Description1": "Desenvolvi sistemas em diversos contextos, incluindo startup e empresa júnior.",
    "Work Experience Description2": "Atualmente, estou cursando meu mestrado e trabalhando em um grande projeto. Abaixo, estão listados alguns dos projetos nos quais participei. Clique para mais detalhes:",
    "You can get in contact":"Pode entrar em contato por whatsapp, email ou minhas redes sociais:",
    "See also":"Veja também",
    "Product/Business Description":"Descrição de produto/Negocio",
    "Technical Description":"Descrição Técnica",
    "My Learning":"Meus Aprendizados",
    "Methodoly and Learnings":"Metodologia e aprendizados",
    "Business and Technical Description":"Descrição Técnica e de Negocio",
    "Previous":"Anterior",
    "Next":"Proximo",
    "How I work":"Como Trabalho",
    "How I work 1":"Eu sou uma pessoa que trabalha com tecnologia e também sou apaixonado por negócios. Acredito que a tecnologia é capaz de levar um negócio a um patamar mais profissional, confiável e escalável, desde que haja processos bem estruturados e organização interna. Por isso, sempre busco aprimorar meus conhecimentos nesses dois campos, para poder oferecer soluções inovadoras e eficientes para as empresas com as quais trabalho.",
    "How I work 2":"Dessa forma, o processo de construção de um projeto começa com a compreensão do problema e a definição do objetivo. Em seguida, são levantadas possibilidades de solução e as melhores ideias são avaliadas, considerando riscos, custos e chances de sucesso. Na quarta fase, um protótipo é construído para testar a ideia. Essas etapas iniciais foram pensadas para serem rápidas e eficientes, permitindo soluções para problemas complexos em um curto espaço de tempo, para depois ir para o desenvolvimento.",
    "How I work 3":"O desenvolvimento de software é incremental, ou seja, feito em etapas. Cada etapa adiciona funcionalidades ou melhorias à versão anterior do software, permitindo avaliar o produto e decidir quais recursos ou melhorias são necessários para a próxima etapa. Ao final de cada etapa, há uma versão testável para receber feedback dos usuários e corrigir problemas ou adicionar recursos para a próxima etapa. Essa abordagem ágil permite às equipes de desenvolvimento responder às necessidades dos usuários e do negócio de maneira eficiente, ajustando às necessidades de mercado ao longo do tempo.",
    "Are you interested in my work? Get in touch:":"Ficou interessado no meu trabalho? Entre em contato:",
    "I hope to contribute":"Espero poder contribuir para o desenvolvimento de projetos de alta qualidade que realmente gerem resultados de negócio.",
    "I always seek to develop my discipline":"Sempre busco desenvolver minha disciplina pois acredito que ela é a chave para alcançar resultados, e faço tudo com dedicação pois gosto de ver os resultados dos meus esforços. Durante o mestrado, estou conhecendo pessoas incrivelmente capacitadas e aprendendo muito com elas, o que tem contribuído para o meu crescimento profissional.",
    "In my leisure time":"Nos meus momentos de lazer, gosto de acompanhar futebol e me exercitar na academia. Também sou gosto muito de música (meu Spotify fica ligado quase o dia todo), e meu gosto é bem eclético, escuto quase tudo.",
    "Currently, I am living in Bragança, Portugal":"Atualmente, estou morando em Bragança, Portugal, onde estou fazendo mestrado, no Instituto Politécnico de Bragança. A experiência de morar fora do país está sendo incrível, pois estou conhecendo pessoas de diversas partes do mundo, o que tem contribuído muito para o meu crescimento pessoal e cultural. Além disso, estou tendo a oportunidade de conhecer lugares incríveis na Europa, como Londres, Barcelona e Atenas.",
    "Hi! My name is Leonardo Leite, I work with software engineering":"Oi! Meu nome é Leonardo Leite, trabalho com engenharia de software, sou natural de Belo Horizonte, Minas Gerais (Brasil). Desde a época da faculdade, me envolvi com empreendedorismo e fui um dos fundadores da empresa júnior de Engenharia de Computação do CEFET-MG. Participar do movimento empresa júnior foi um marco na minha vida, tanto pessoal quanto profissional."
}