{
    "project name":"Sistema Para Atendimento ao Cliente",
    "business description":"Esse projeto foi iniciado durante a pandemia, durante o meu tempo na empresa júnior, com o objetivo de auxiliar uma empresa de inspeção veicular a fornecer atendimento remoto aos seus clientes. Para atender a essa necessidade, foi desenvolvido um sistema com um site onde os administradores podem receber as demandas dos clientes, analisar documentos e fornecer respostas às solicitações. Além disso, foi criado um aplicativo para que os clientes possam solicitar atendimento, enviar documentos e receber retorno da empresa.",
    "technical description":"No aspecto técnico, este projeto foi construído utilizando uma API Rest em NodeJS com o framework Express, um banco de dados MySQL e o frontend (site acessado pelos administradores) em ReactJS. Além disso, o aplicativo para clientes foi desenvolvido em Flutter e os documentos foram armazenados utilizando o serviço S3 da AWS. Quando uma solicitação era feita, um novo pedido era criado no banco de dados contendo as informações do cliente e referências aos documentos no S3. Conforme o atendimento avançava, o status do pedido era atualizado e o cliente recebia notificações pelo aplicativo.",
    "Work Methodology":"Para gerenciar esse projeto, utilizamos o Scrum em uma equipe de 6 pessoas, com sprints de 2 semanas e reuniões constantes com o cliente para revisão. Antes de cada sprint, realizamos a planning para definir os objetivos para as próximas duas semanas, e diariamente realizamos reuniões internas para acompanhar o progresso (daily meetings) e garantir que o projeto estava seguindo conforme o esperado. Antes do desenvolvimento, foi criado um protótipo do sistema utilizando o Figma e, a cada sprint, uma parte do sistema era entregue.",
    "my learnings":"Durante este projeto, tive muitas oportunidades de aprendizado, pois, como parte de uma empresa júnior, fui responsável tanto pela parte técnica quanto pela gestão e comunicação com o cliente. Isso contribuiu significativamente para o meu crescimento profissional. Durante esse período, aprendi muito sobre gestão de projetos e gestão de pessoas, além de desenvolver habilidades de ensino eficaz, já que precisei compartilhar conhecimentos adquiridos em outras experiencias (como o estagio) com os outros membros da equipe."
}