{
    "project name":"Sistema Para Coleta de Dados",
    "business description":"Esse projeto foi desenvolvido durante meu estágio na DTI Digital. O cliente que estávamos atendendo tinha uma demanda para melhorar a coleta e armazenamento de dados de auditoria e processos internos. Para atender essa demanda, desenvolvemos um sistema que facilita a formatação, armazenamento e coleta desses dados. O sistema é composto por uma parte web, onde formulários são criados, um banco de dados seguro onde as informações são armazenadas e disponibilizadas para análise, e um aplicativo que facilita a coleta desses dados.",
    "technical description":"Em relação à parte técnica, o projeto utilizou o .NetCore para construir a API que serve tanto a parte web quanto o aplicativo. O banco de dados escolhido foi o SQL Server, devido à empresa já estar inserida no contexto da Microsoft. Para o frontend web, foi utilizado React com Typescript e, para o frontend mobile, foi utilizado Flutter.  A API disponibilizava as informações em formato JSON para facilitar a conexão com ferramentas como PowerBI e, assim, realizar a análise dos dados gerados. O sistema foi publicado utilizando a plataforma da Azure com o Active Directory para gestao permissões.",
    "Work Methodology":"Para a construção deste projeto, foi inicialmente realizado um design sprint para entender as necessidades que o produto deveria atender. Em seguida, um protótipo foi desenvolvido utilizando ferramentas de design, como o Figma, para validar com o cliente o que seria construído. Durante o desenvolvimento, foi utilizado o Scrum com sprints de duas semanas, reuniões recorrentes com os clientes, planejamento no início de cada sprint e reuniões diárias de acompanhamento (daily meetings) e revisões no final de cada sprint. Alguns ritos adicionais foram realizados, como o check arquitetural, para discutir aspectos da arquitetura do sistema com outros squads da empresa.",
    "my learnings":"Com esse projeto, eu pude adquirir diversos conhecimentos e habilidades valiosas para o meu desenvolvimento profissional. Aprendi sobre o desenvolvimento de software em um contexto ágil, o Scrum e a gestão de stakeholders. Esses aprendizados foram muito úteis para a minha participação em outros projetos, como os realizados na empresa júnior. Além disso, tecnicamente, participar desse projeto foi extremamente enriquecedor, já que eu pude acompanhar a construção de um grande sistema desde o início, entendendo cada etapa e as consequências de cada decisão tomada."
}