{
    "project name":"Data Lake Manutenção preditivas",
    "business description":"Durante meu mestrado, estou desenvolvendo um projeto de construção de um data lake para agregação de dados da linha de produção de uma empresa. Com o objetivo de melhorar a eficiência da linha de produção, o sistema processa dados coletados por sensores em cada máquina, aplicando análise estatística e preditiva para identificar tendências e comportamentos que possam causar interrupções ou defeitos no processo, e disponibiliza as informações em um dashboard que pode ser acessado pela web. Com a implementação desse projeto, espera-se reduzir o tempo de parada das máquinas, diminuir a quantidade de peças defeituosas e aumentar a eficiência da linha de produção como um todo.",
    "technical description":"Para a parte técnica do projeto, o sistema é dividido em módulos de processamento, API e dashboard. O processamento dos dados é realizado por pequenos módulos em Python que são executados periodicamente para analisar os dados mais recentes e gerar informações estatísticas agregadas. Para disponibilizar as informações para o frontend (dashboard), está sendo desenvolvida uma API em Python usando o framework FastAPI. Essa API é responsável por fornecer dados históricos gerados pelos módulos de processamento, bem como dados recebidos em tempo real via stream. O frontend está sendo construído em ReactTS com NextJs e utiliza a biblioteca Recharts para a construção de gráficos. Para gerenciar as informações globais da aplicação, o Context API é utilizado.",
    "work methodology":"Para a execução deste projeto, iniciamos com uma análise junto à empresa para identificar as principais informações que seriam úteis de serem apresentadas no dashboard. Com base nessa análise, criamos um protótipo no Figma para deixar claro como seria o desenvolvimento. Após a aprovação do protótipo, demos início à execução do projeto. Como estou desenvolvendo o projeto sozinho, realizamos reuniões mensais para apresentar o andamento, tirar dúvidas e garantir que o projeto esteja caminhando em direção ao objetivo desejado. Ao final de cada reunião, definimos os objetivos para o próximo mês para que todos os envolvidos estejam alinhados.",
    "my learnings":"Com este projeto, estou adquirindo valiosos aprendizados sobre o contexto e as necessidades de uma indústria em se tornar mais digital e utilizar as novas tecnologias de maneira eficiente para gerar resultados positivos. Na parte técnica, estou tendo a oportunidade de trabalhar com análise estatística de dados de forma prática, além de construir um data lake com diversas camadas e orquestrar pequenos módulos de processamento em Python. Também estou aprofundando meus conhecimentos em React e Next.js, o que certamente será um grande diferencial em meus próximos projetos."
}