{
    "project name":"JobPet App do Profissional",
    "business description":"Este projeto consiste em um aplicativo que atua como intermediário entre profissionais do mercado pet e empresas que necessitam de mão de obra qualificada. O aplicativo permite que os usuários publiquem um vídeo que será utilizado como currículo, adicionem informações como foto, descrição e experiências profissionais, além de visualizar vagas em aberto. O aplicativo faz parte de um sistema maior que inclui uma plataforma web, onde as empresas publicam vagas e visualizam os perfis dos profissionais que se candidataram.",
    "technical description":"O aplicativo foi inicialmente prototipado no Figma e construído em Flutter, com o uso do gerenciador de estados MobX e da clean architecture, permitindo a fácil substituição de módulos no futuro, caso necessario. A API que fornece as informações para o aplicativo foi desenvolvida em NodeJS e passou por modificações frequentes para atender às demandas do aplicativo. O banco de dados escolhido foi o MongoDB, por sua facilidade de uso e flexibilidade, que são essenciais em um ambiente de startup.",
    "Work Methodology":"Para construir o aplicativo, as demandas eram organizadas em um quadro do Trello e agrupadas por versão. Assim que todas as demandas de uma versão eram concluídas, uma nova versão era lançada na Google Play. As demandas eram levantadas pelo CEO da startup e alinhadas com a equipe técnica, que era composta por três pessoas na época. Reuniões semanais foram realizadas para testar o aplicativo, discutir novas funcionalidades e alinhar os objetivos de curto prazo. A metodologia de trabalho era semelhante ao Kanban, que é amplamente utilizado em empresas em todo o mundo.",
    "my learnings":"Durante o desenvolvimento desse projeto, pude adquirir um grande aprendizado sobre o contexto de startups, trabalhando em um ambiente altamente flexível, com mudanças constantes e muitas incertezas. Aprendi a ter mais liberdade para testar e validar hipóteses de solução para os problemas que surgiam, além de desenvolver minhas habilidades de organização pessoal e disciplina, fundamentais para alcançar os objetivos estabelecidos. No âmbito técnico, pude aprofundar meus conhecimentos em Flutter, além de aprender a trabalhar de forma mais eficiente com NodeJs e MongoDB, tecnologias muito uteis e utilizadas em diversos projetos."
}