{
    "project name":"Este Portfolio",
    "business description":"Este portfólio foi criado com o objetivo de me apresentar de forma mais completa para oportunidades na área de engenharia de software. Ele foi projetado para facilitar o contato com possíveis clientes e empresas interessadas, apresentando informações sobre mim, minhas experiências profissionais e a forma como trabalho. Por meio dele, espero demonstrar minhas habilidades e competências, destacando projetos relevantes e experiências significativas que contribuam para minha qualificação como profissional na área de engenharia de software.",
    "technical description":"Meu portfólio foi criado com ReactTS, Next.js e Material UI 5. O TypeScript foi escolhido por sua tipagem estática e clareza no código. O Next.js oferece recursos robustos, como otimização de imagens e renderização do lado do servidor. A biblioteca Material UI 5 tornou o processo de desenvolvimento e estilização mais eficiente e dinâmico. O resultado é um portfólio atraente e fácil de navegar para possíveis clientes e empresas interessadas em meus serviços.",
    "work methodology":"Para construir este portfólio, eu comecei por listar todas as informações que desejava apresentar, bem como as premissas que precisava atender. Em seguida, criei um protótipo no Figma, tanto para a versão mobile quanto para a versão desktop. Depois, organizei todas as telas em um quadro Kanban dentro do Notion e iniciei o desenvolvimento. Com essa metodologia, consegui ter uma visão clara e organizada de todo o processo de criação do portfólio, desde a concepção das ideias até a execução.",
    "my learnings":"Com o desenvolvimento deste portfólio, tive a oportunidade de aprofundar meus conhecimentos em ReactTS e aprimorar minhas habilidades no grande framework frontend NextJS. Além disso, aprendi a configurar e utilizar a biblioteca Material UI 5 em um projeto do início ao fim. Com esses novos conhecimentos adquiridos, agora sinto mais facilidade e segurança para desenvolver aplicações frontend de alta qualidade."
}