{
    "project name":"App Para Otimização de Recursos",
    "business description":"Neste projeto, a necessidade do cliente era otimizar a manutenção de estruturas internas em plantas industriais, reduzindo os custos com materiais e mão de obra. O aplicativo recebe como entrada os tamanhos dos materiais a serem utilizados e o tamanho do espaço a ser preenchido, retornando uma lista de possíveis configurações que poderiam otimizar o uso dos recursos.",
    "technical description":"O aplicativo foi desenvolvido em Flutter com uma arquitetura dividida em camadas e utilizando o MobX para gerenciamento de estados. A premissa do app era ter uma interface amigável e não travar durante o cálculo, proporcionando uma boa experiência ao usuário. Por isso, foram utilizadas chamadas assíncronas e telas de carregamento para garantir que o usuário entendesse tudo o que estava acontecendo. Para a gestão de acesso, foi utilizado o Activity Directory do Azure e o Figma para a construção de protótipos.",
    "work methodology":"Para o desenvolvimento deste projeto, inicialmente fizemos validações em relação ao cálculo para saber se seria possível realizá-lo dentro do sistema e também realizamos um design sprint para compreender as necessidades do cliente. Em seguida, foram construídos os protótipos e, então, o desenvolvimento foi iniciado. Utilizamos a metodologia Scrum com sprints de duas semanas para cada parte do aplicativo, de forma a concluir a primeira versão do app no final do projeto.",
    "my learnings":"Durante o desenvolvimento deste projeto, adquiri conhecimentos valiosos sobre arquitetura limpa e como garantir a consistência na experiência do usuário. Tive a oportunidade de trabalhar em parceria com um desenvolvedor mais experiente e absorver uma grande quantidade de informações. Além disso, aprimorei meu entendimento sobre o contexto e a dinâmica de trabalho dentro de uma indústria. Essa experiência me permitiu crescer tanto profissionalmente quanto pessoalmente e irei para aplicar esses aprendizados em futuros projetos."
}